arribada/linkit-v4-core/ports/nrf52840/core/hardware/bma400/bma400.cpp
/**
 * @file bma400.cpp
 * @brief BMA400 accelerometer driver — I2C wrapper over Bosch C library + FIFO support.
 */

#include <cmath>
#include <algorithm>

#include "bma400.h"
#include "bma400.hpp"
#include "bma400_defs.h"

#include "debug.hpp"
#include "nrf_delay.h"
#include "nrf_i2c.hpp"
#include "bsp.hpp"
#include "pmu.hpp"
#include "error.hpp"
#include "config_store.hpp"
#include "gpio.hpp"
#include "interrupt_lock.hpp"

extern ConfigurationStore *configuration_store;

// ═══════════════════════════════════════════════════════
//  Device manager (static table — replaces std::map, ISR-safe)
// ═══════════════════════════════════════════════════════

/// @brief Static device table for Bosch C callback lookup (replaces std::map, ISR-safe).
static BMA400LL *s_devices[BMA400_MAX_DEVICES] = {};

/// @brief Register a BMA400LL instance and return its lookup ID.
/// @param dev  Pointer to the device to register.
/// @return Lookup ID (0..BMA400_MAX_DEVICES-1).
static uint8_t device_register(BMA400LL *dev) {
	for (uint8_t i = 0; i < BMA400_MAX_DEVICES; i++) {
		if (s_devices[i] == nullptr) {
			s_devices[i] = dev;
			return i;
		}
	}
	DEBUG_ERROR("BMA400: device table full (%u max)", BMA400_MAX_DEVICES);
	return 0;  // Fallback — shouldn't happen with 1-2 instances
}

/// @brief Remove a device from the lookup table.
static void device_unregister(uint8_t id) {
	if (id < BMA400_MAX_DEVICES) s_devices[id] = nullptr;
}

/// @brief Lookup a device by ID.
/// @param id  Device ID from device_register().
/// @return Pointer to the device, or nullptr if not found.
static BMA400LL *device_lookup(uint8_t id) {
	return (id < BMA400_MAX_DEVICES) ? s_devices[id] : nullptr;
}


// ═══════════════════════════════════════════════════════
//  BMA400LL — Constructor / Destructor
// ═══════════════════════════════════════════════════════

BMA400LL::BMA400LL(unsigned int bus, unsigned char addr, int wakeup_pin)
	: m_bus(bus)
	, m_addr(addr)
	, m_irq(NrfIRQ(wakeup_pin))
	, m_unique_id(device_register(this))
	, m_irq_pending(false)
	, m_g_range(BMA400_RANGE_2G)
	, m_power_mode(0)
	, m_wakeup_threshold(0.1)
	, m_wakeup_duration(1)
	, m_cal_x(0)
	, m_cal_y(0)
	, m_cal_z(1.0)
{
	DEBUG_TRACE("BMA400LL(%u, 0x%02X, pin=%d)", bus, addr, wakeup_pin);
	try {
		init();
	} catch (...) {
		DEBUG_ERROR("BMA400LL: init failed — unregistering");
		device_unregister(m_unique_id);
		throw;
	}
}

BMA400LL::~BMA400LL()
{
	device_unregister(m_unique_id);
}

/// @brief I2C probe, soft reset, enter SLEEP mode.
void BMA400LL::init()
{
	SensorsPowerGuard power_guard;
	int8_t rslt;

	m_bma400_dev.intf = BMA400_I2C_INTF;
	m_bma400_dev.intf_ptr = &m_unique_id;
	m_bma400_dev.read = reinterpret_cast<bma400_read_fptr_t>(i2c_read);
	m_bma400_dev.write = reinterpret_cast<bma400_write_fptr_t>(i2c_write);
	m_bma400_dev.delay_us = reinterpret_cast<bma400_delay_us_fptr_t>(delay_us);
	m_bma400_dev.read_write_len = BMA400_RW_LENGTH;
	m_bma400_dev.resolution = 12;

	rslt = bma400_init(&m_bma400_dev);
	check_result("bma400_init", rslt);

	rslt = bma400_soft_reset(&m_bma400_dev);
	check_result("bma400_soft_reset", rslt);

	setup_sleep_mode();
	DEBUG_TRACE("BMA400LL::init complete");
}


// ═══════════════════════════════════════════════════════
//  I2C callbacks (static, called from Bosch C driver)
// ═══════════════════════════════════════════════════════

/// @brief Bosch C driver I2C write callback.
int8_t BMA400LL::i2c_write(uint8_t reg_addr, const uint8_t *reg_data, uint32_t length, void *intf_ptr)
{
	BMA400LL *dev = device_lookup(*static_cast<uint8_t *>(intf_ptr));
	if (!dev) return BMA400_E_NULL_PTR;

	if (!length) return BMA400_OK;
	if (length > BMA400_MAX_LEN) return BMA400_E_INVALID_CONFIG;

	uint8_t buffer[BMA400_MAX_LEN + 1];
	buffer[0] = reg_addr;
	memcpy(&buffer[1], reg_data, length);

	NrfI2C::write(dev->m_bus, dev->m_addr, buffer, length + 1, false);
	return BMA400_OK;
}

/// @brief Bosch C driver I2C read callback.
int8_t BMA400LL::i2c_read(uint8_t reg_addr, uint8_t *reg_data, uint32_t length, void *intf_ptr)
{
	BMA400LL *dev = device_lookup(*static_cast<uint8_t *>(intf_ptr));
	if (!dev) return BMA400_E_NULL_PTR;

	NrfI2C::write(dev->m_bus, dev->m_addr, &reg_addr, 1, true);
	NrfI2C::read(dev->m_bus, dev->m_addr, reg_data, length);
	return BMA400_OK;
}

/// @brief Bosch C driver delay callback.
void BMA400LL::delay_us(uint32_t period, void *)
{
	PMU::delay_us(period);
}


// ═══════════════════════════════════════════════════════
//  Utility
// ═══════════════════════════════════════════════════════

/// @brief Convert raw 12-bit LSB to m/s² for the given range.
/// @param accel_data  Raw accelerometer value (signed 12-bit).
/// @param g_range     Range in g-force (2, 4, 8, or 16).
/// @param bit_width   ADC resolution (12 for BMA400).
/// @return Acceleration in m/s².
double BMA400LL::lsb_to_ms2(int16_t accel_data, uint8_t g_range, uint8_t bit_width)
{
	constexpr double GRAVITY = 9.80665;
	int16_t half_scale = 1 << (bit_width - 1);
	return (GRAVITY * accel_data * g_range) / half_scale;
}

/// @brief Convert raw 12-bit LSB to g-force using current range setting.
double BMA400LL::lsb_to_g(int16_t raw) const
{
	uint8_t g = range_to_g(m_g_range);
	int16_t half_scale = 1 << (12 - 1);
	return static_cast<double>(raw * g) / half_scale;
}

/// @brief Convert range register value to g-force (2, 4, 8, or 16).
uint8_t BMA400LL::range_to_g(uint8_t range_reg) const
{
	static constexpr uint8_t g_table[] = { 2, 4, 8, 16 };
	return (range_reg < 4) ? g_table[range_reg] : 4;
}

/// @brief Convert g-force threshold to BMA400 register value (0-255).
uint8_t BMA400LL::calculate_threshold_reg(double threshold_g, uint8_t acc_range)
{
	double lsb = static_cast<double>(1 << (2 + acc_range)) / 4096.0;
	uint16_t threshold_raw = static_cast<uint16_t>(threshold_g / lsb);
	return static_cast<uint8_t>(std::min<uint16_t>(255, threshold_raw));
}

/// @brief Check Bosch API result — log and throw on error.
void BMA400LL::check_result(const char *api_name, int8_t rslt)
{
	if (rslt == BMA400_OK) return;

	const char *msg;
	switch (rslt) {
	case BMA400_E_NULL_PTR:       msg = "Null pointer"; break;
	case BMA400_E_COM_FAIL:       msg = "Communication failure"; break;
	case BMA400_E_INVALID_CONFIG: msg = "Invalid configuration"; break;
	case BMA400_E_DEV_NOT_FOUND:  msg = "Device not found"; break;
	default:                      msg = "Unknown error"; break;
	}

