arribada/linkit-v4-core/ports/nrf52840/core/hardware/bma400/bma400.cpp
	// NORMAL mode at 100 Hz for calibration
	rslt = bma400_set_power_mode(BMA400_MODE_NORMAL, &m_bma400_dev);
	check_result("calibrate: set_power_mode", rslt);

	struct bma400_sensor_conf conf = {};
	conf.type = BMA400_ACCEL;
	rslt = bma400_get_sensor_conf(&conf, 1, &m_bma400_dev);
	conf.param.accel.odr = BMA400_ODR_100HZ;
	conf.param.accel.range = g_range;
	conf.param.accel.data_src = BMA400_DATA_SRC_ACCEL_FILT_2;
	rslt = bma400_set_sensor_conf(&conf, 1, &m_bma400_dev);
	check_result("calibrate: set_sensor_conf", rslt);

	struct bma400_int_enable int_en = { .type = BMA400_DRDY_INT_EN, .conf = BMA400_ENABLE };
	rslt = bma400_enable_interrupt(&int_en, 1, &m_bma400_dev);
	check_result("calibrate: enable_interrupt", rslt);
	PMU::delay_ms(100);

	DEBUG_TRACE("BMA400: calibrating (%u samples)...", N_SAMPLES);
	unsigned int n_ok = 0;
	for (uint8_t i = 0; i < N_SAMPLES; ++i) {
		// Wait for DRDY with timeout
		uint16_t int_status = 0;
		bool ready = false;
		for (unsigned int j = 0; j < BMA400_DRDY_MAX_POLLS; j++) {
			rslt = bma400_get_interrupt_status(&int_status, &m_bma400_dev);
			if (int_status & BMA400_ASSERTED_DRDY_INT) { ready = true; break; }
			PMU::delay_ms(1);
		}
		if (!ready) {
			DEBUG_WARN("BMA400: calibrate DRDY timeout at sample %u", i);
			continue;  // Skip this sample, don't use stale data
		}

		struct bma400_sensor_data data;
		rslt = bma400_get_accel_data(BMA400_DATA_ONLY, &data, &m_bma400_dev);
		if (rslt != BMA400_OK) {
			DEBUG_WARN("BMA400: calibrate accel read failed at sample %u", i);
			continue;
		}
		acc_x += lsb_to_ms2(data.x, g_force, 12) / GRAVITY;
		acc_y += lsb_to_ms2(data.y, g_force, 12) / GRAVITY;
		acc_z += lsb_to_ms2(data.z, g_force, 12) / GRAVITY;
		n_ok++;
	}

	setup_sleep_mode();

	// Divide by the number of samples that ACTUALLY landed, not the constant
	// N_SAMPLES: if DRDY was failing most iterations `continue` above, and
	// dividing by 200 yields garbage (all-skipped -> offset_z=0 instead of ~1g)
	// that would be written to AXL.CAL. If nothing landed, keep identity offsets
	// (no calibration) rather than write zeros.
	if (n_ok == 0) {
		DEBUG_ERROR("BMA400: calibration failed — no valid samples; using identity offsets");
		offset_x = 0.0;
		offset_y = 0.0;
		offset_z = 1.0;
	} else {
		if (n_ok < N_SAMPLES / 2)
			DEBUG_WARN("BMA400: calibration used only %u/%u samples", n_ok, (unsigned)N_SAMPLES);
		offset_x = acc_x / n_ok;
		offset_y = acc_y / n_ok;
		offset_z = acc_z / n_ok;
	}

	DEBUG_TRACE("BMA400: calibrated x=%.4f y=%.4f z=%.4f g", offset_x, offset_y, offset_z);
}


// ═══════════════════════════════════════════════════════
//  Wakeup / Interrupt
// ═══════════════════════════════════════════════════════

/// @brief Enable motion wakeup: re-init device, configure mode, register IRQ callback.
void BMA400LL::enable_wakeup(std::function<void()> func)
{
	SensorsPowerGuard power_guard;
	int8_t rslt;

	DEBUG_INFO("BMA400::enable_wakeup: mode=%u (%s)",
	           m_power_mode, m_power_mode == 0 ? "LOW_POWER" : "NORMAL");

	rslt = bma400_init(&m_bma400_dev);
	check_result("enable_wakeup: init", rslt);

	rslt = bma400_soft_reset(&m_bma400_dev);
	check_result("enable_wakeup: soft_reset", rslt);

	if (m_power_mode == 0) {
		setup_active_mode();
		enable_wakeup_low_power(func);
	} else {
		setup_normal_mode();
		enable_wakeup_normal(func);
	}
}

/// @brief Configure BMA400 auto-wakeup engine with threshold detection (mode 0).
void BMA400LL::enable_wakeup_low_power(std::function<void()> func)
{
	int8_t rslt;

	struct bma400_device_conf dev_conf = {};
	dev_conf.type = BMA400_AUTOWAKEUP_INT;

	rslt = bma400_get_device_conf(&dev_conf, 1, &m_bma400_dev);
	if (rslt == BMA400_OK) {
		dev_conf.param.wakeup.wakeup_axes_en = BMA400_AXIS_XYZ_EN;
		dev_conf.param.wakeup.wakeup_ref_update = BMA400_UPDATE_EVERY_TIME;
		dev_conf.param.wakeup.sample_count = BMA400_SAMPLE_COUNT_4;
		dev_conf.param.wakeup.int_wkup_threshold = calculate_threshold_reg(m_wakeup_threshold, m_g_range);
		dev_conf.param.wakeup.int_chan = BMA400_MAP_BOTH_INT_PINS;

		rslt = bma400_set_device_conf(&dev_conf, 1, &m_bma400_dev);
		if (rslt == BMA400_OK) {
			m_int_enable.type = BMA400_GEN1_INT_EN;
			m_int_enable.conf = BMA400_ENABLE;
			rslt = bma400_enable_interrupt(&m_int_enable, 1, &m_bma400_dev);
		}
	}

	m_irq.enable([this, func]() {
		if (!m_irq_pending) {
			m_irq_pending = true;
			func();
		}
	});
}

/// @brief Configure GEN1 activity interrupt for motion detection (mode 1).
void BMA400LL::enable_wakeup_normal(std::function<void()> func)
{
	int8_t rslt;

	m_sensor_conf[1].type = BMA400_GEN1_INT;
	m_sensor_conf[1].param.gen_int.gen_int_thres = calculate_threshold_reg(m_wakeup_threshold, m_g_range);
	m_sensor_conf[1].param.gen_int.gen_int_dur = static_cast<uint8_t>(m_wakeup_duration - 1);
	m_sensor_conf[1].param.gen_int.axes_sel = BMA400_AXIS_XYZ_EN;
	m_sensor_conf[1].param.gen_int.data_src = BMA400_DATA_SRC_ACC_FILT2;
	m_sensor_conf[1].param.gen_int.criterion_sel = BMA400_ACTIVITY_INT;
	m_sensor_conf[1].param.gen_int.evaluate_axes = BMA400_ANY_AXES_INT;
	m_sensor_conf[1].param.gen_int.ref_update = BMA400_UPDATE_EVERY_TIME;
	m_sensor_conf[1].param.gen_int.hysteresis = BMA400_HYST_96_MG;
	m_sensor_conf[1].param.gen_int.int_thres_ref_x = 0;
	m_sensor_conf[1].param.gen_int.int_thres_ref_y = 0;
	m_sensor_conf[1].param.gen_int.int_thres_ref_z = 32;
	m_sensor_conf[1].param.gen_int.int_chan = BMA400_INT_CHANNEL_1;

	rslt = bma400_set_sensor_conf(m_sensor_conf, 2, &m_bma400_dev);
	check_result("enable_wakeup_normal: set_sensor_conf", rslt);

	m_int_enable.type = BMA400_GEN1_INT_EN;
	m_int_enable.conf = BMA400_ENABLE;
	rslt = bma400_enable_interrupt(&m_int_enable, 1, &m_bma400_dev);
	check_result("enable_wakeup_normal: enable_interrupt", rslt);

	m_irq.enable([this, func]() {
		if (!m_irq_pending) {
			m_irq_pending = true;
			func();
		}
	});
}

/// @brief Disable wakeup interrupt, return to SLEEP mode.
void BMA400LL::disable_wakeup()
{
	SensorsPowerGuard power_guard;
	int8_t rslt;

	m_irq.disable();

	rslt = bma400_set_power_mode(BMA400_MODE_SLEEP, &m_bma400_dev);
	check_result("disable_wakeup: set_power_mode", rslt);

	m_int_enable.type = BMA400_GEN1_INT_EN;
	m_int_enable.conf = BMA400_DISABLE;
	rslt = bma400_enable_interrupt(&m_int_enable, 1, &m_bma400_dev);
	check_result("disable_wakeup: disable_interrupt", rslt);

